Revit 2024 API
BuiltInFailures.StairRampFailures.LandingShapeHandleOnPinnedRunFailure Property
 Cannot Drag the automatic landing shape handle control because the connected run is pinned.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LandingShapeHandleOnPinnedRunFailure { get; }
Visual Basic
Public Shared ReadOnly Property LandingShapeHandleOnPinnedRunFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LandingShapeHandleOnPinnedRunFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace